//COMPILE JOB (ACCT),'COMPILE COBOL',CLASS=A,MSGCLASS=H,NOTIFY=HERC01
//CBL      EXEC PGM=IKFCBL00
//SYSLIB   DD DSN=SYS1.COBLIB,DISP=SHR
//SYSIN    DD DSN=HERC01.COBOL(INTERESTABLISHED),DISP=SHR
//SYSLIN   DD DSN=HERC01.LOADLIB(INTEREST),DISP=(NEW,CATLG),SPACE=(TRK,(10,10))
//SYSUT1   DD DSN=&&TEMPORARY,DISP=(NEW,DELETE),SPACE=(TRK,(10,10))
//SYSUT2   DD DSN=&&TEMP2,DISP=(NEW,DELETE),SPACE=(TRK,(10,10))
//SYSUT3   DD DSN=&&TEMP3,DISP=(NEW,DELETE),SPACE=(TRK,(10,10))
//SYSUT4   DD DSN=&&TEMP4,DISP=(NEW,DELETE),SPACE=(TRK,(10,10))
//SYSPRINT DD SYSOUT=*