//INTEREST JOB (ACCT),'CALC INTEREST',CLASS=A,MSGCLASS=H,NOTIFY=HERC01
//STEP1    EXEC PGM=INTEREST
//STEPLIB  DD DSN=HERC01.LOADLIB,DISP=SHR
//INPUTDD  DD DSN=HERC01.BANK.ACCOUNTS,DISP=SHR
//OUTPUTDD DD DSN=HERC01.BANK.INTEREST,DISP=(NEW,CATLG,DELETE),
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=8000),
//         SPACE=(TRK,(5,5),RLSE)
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY

